logs/20240610-045841-dummy_file.00003235/iodepth=8/rw=write/fio.log
job: (g=0): rw=write, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=libaio, iodepth=8
fio-3.35
Starting 1 process

job: (groupid=0, jobs=1): err= 0: pid=89749: Mon Jun 10 05:06:54 2024
  write: IOPS=195, BW=97.7MiB/s (102MB/s)(10.0GiB/104816msec); 0 zone resets
    slat (usec): min=35, max=61286, avg=97.09, stdev=1048.72
    clat (usec): min=1745, max=240405, avg=40844.50, stdev=28883.10
     lat (usec): min=1812, max=240548, avg=40941.59, stdev=28937.47
    clat percentiles (msec):
     |  1.00th=[    4],  5.00th=[    9], 10.00th=[   12], 20.00th=[   18],
     | 30.00th=[   25], 40.00th=[   30], 50.00th=[   35], 60.00th=[   41],
     | 70.00th=[   48], 80.00th=[   59], 90.00th=[   77], 95.00th=[   96],
     | 99.00th=[  153], 99.50th=[  174], 99.90th=[  201], 99.95th=[  203],
     | 99.99th=[  228]
   bw (  KiB/s): min=45056, max=148480, per=100.00%, avg=100077.63, stdev=19055.57, samples=209
   iops        : min=   88, max=  290, avg=195.46, stdev=37.22, samples=209
  lat (msec)   : 2=0.01%, 4=1.09%, 10=6.49%, 20=16.65%, 50=48.33%
  lat (msec)   : 100=23.23%, 250=4.21%
  cpu          : usr=0.12%, sys=1.31%, ctx=6700, majf=0, minf=9
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,20480,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=97.7MiB/s (102MB/s), 97.7MiB/s-97.7MiB/s (102MB/s-102MB/s), io=10.0GiB (10.7GB), run=104816-104816msec

Disk stats (read/write):
    md127: ios=0/20545, merge=0/0, ticks=0/838443, in_queue=838443, util=98.86%, aggrios=6464/15613, aggrmerge=200350/511732, aggrticks=58808/83486, aggrin_queue=147274, aggrutil=43.31%
  sdf: ios=6631/15733, merge=206421/513271, ticks=62646/91468, in_queue=158944, util=42.87%
  sdd: ios=6450/15634, merge=200512/508276, ticks=51423/71948, in_queue=127747, util=36.38%
  sdb: ios=6410/15651, merge=197933/512103, ticks=60568/79145, in_queue=145282, util=38.87%
  sdi: ios=6396/15845, merge=202856/514417, ticks=57628/86279, in_queue=149059, util=42.13%
  sdg: ios=6482/15284, merge=199349/508641, ticks=57709/81576, in_queue=143630, util=41.09%
  sde: ios=6416/15460, merge=197488/512611, ticks=57905/84286, in_queue=147152, util=38.48%
  sdc: ios=6359/15833, merge=197534/516635, ticks=58945/76657, in_queue=141271, util=38.71%
  sdh: ios=6573/15465, merge=200711/507904, ticks=63642/96534, in_queue=165107, util=43.31%